In [22]:
import numpy as np
import pandas as pd

**Based on the data frame created in the previous task, display the fourth 
line. Then write those students who scored above average to a separate 
box.**

In [23]:
student_scores_data = {
    "Names": ['Merli', 'Aigi', 'Olga', 'Martin', 'Indrek', 'Andres', 'Kerly', 'Merili', 'Sten', 'Niko'],
    "Scores": [100, 75, 85, 45, 50, 55, 73, 89, 94, 100]
}
student_score_table = pd.DataFrame(student_scores_data, index=[1, 2, 3, 4, 5, 6, 7, 8, 9, 10])  # Created dataframe about students and their exams scores
student_score_table #'row0', 'row1', 'row2','row3', 'row4','row5', 'row6','row7', 'row8','row9'

     Names  Scores
1    Merli     100
2     Aigi      75
3     Olga      85
4   Martin      45
5   Indrek      50
6   Andres      55
7    Kerly      73
8   Merili      89
9     Sten      94
10    Niko     100

**Display the forth row**

In [24]:
student_score_table.loc[3]

Names     Olga
Scores      85
Name: 3, dtype: object

In [25]:
student_score_table.iloc[2]

Names     Olga
Scores      85
Name: 3, dtype: object

**new data structure for students who scores were higher than average**

In [43]:
student_score_table[(student_score_table.Scores > student_score_table['Scores'].mean())]

     Names  Scores
1    Merli     100
3     Olga      85
8   Merili      89
9     Sten      94
10    Niko     100